In [ ]:
#qn1

In [1]:
import pandas as pd

In [12]:
list=[1,2,3,4,5]
x=pd.Series(list)
print(x)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [ ]:
#qn2

In [46]:
date_series = pd.date_range(start = '05-01-2021', end = '05-12-2021')

print(date_series)

DatetimeIndex(['2021-05-01', '2021-05-02', '2021-05-03', '2021-05-04',
               '2021-05-05', '2021-05-06', '2021-05-07', '2021-05-08',
               '2021-05-09', '2021-05-10', '2021-05-11', '2021-05-12'],
              dtype='datetime64[ns]', freq='D')

In [ ]:
#qn3

In [16]:
details = {
'Name' : ['Ankit', 'Aishwarya', 'Soumya','Shiva'],
'Age' : [23, 21, 22, 21],
'Place':['kollam','kannur','idukki','alapuzha']
}
df = pd.DataFrame(details)
df

        Name  Age     Place
0      Ankit   23    kollam
1  Aishwarya   21    kannur
2     Soumya   22    idukki
3      Shiva   21  alapuzha

In [ ]:
#qn4

In [18]:

list = [['tom', 'reacher', 25], ['krish', 'pete', 30], 
['nick', 'wilson', 26], ['juli', 'williams', 22]] 
df = pd.DataFrame(list, columns =['FName', 'LName', 'Age']) 
print(df)

   FName     LName  Age
0    tom   reacher   25
1  krish      pete   30
2   nick    wilson   26
3   juli  williams   22

In [ ]:
#qn5

In [19]:
df=pd.read_csv("data.csv")
df

      name  age course
0     deva   22    mca
1   anjana   23    cse
2     anju   25    eee
3      jay   21   mech
4      raj   23  civil
5   vishnu   27  mtech
6  nadhana   26  mtech

In [ ]:
#qn6

In [52]:
lists = [[2, 'Vishal', 22],
         [1, 'Kushal', 25],
         [1, 'Aman', 24]]
dataframe = pd.DataFrame(lists, columns = ['id', 'name', 'age'])
dataframe_sorted = dataframe.sort_values(by = ['id', 'age']) 
print(dataframe_sorted)

   id    name  age
2   1    Aman   24
1   1  Kushal   25
0   2  Vishal   22

In [ ]:
#qn7

In [42]:
technologies = ({
    'Courses':["Spark","Hadoop","pandas","Oracle","Java"],
    'Fee' :[20000,25000,26000,22000,20000],
    'Duration':['30days','35days','40days','50days','60days'],
    'Discount':[1000,2300,1500,1200,2500]
               })
df = pd.DataFrame(technologies, index = ['a','b','c','d','e'])
print(df)

  Courses    Fee Duration  Discount
a   Spark  20000   30days      1000
b  Hadoop  25000   35days      2300
c  pandas  26000   40days      1500
d  Oracle  22000   50days      1200
e    Java  20000   60days      2500

In [ ]:
#qn8

In [45]:
details = {
'Name' : ['Ankit', 'Aishwarya', 'Soumya','Shiva'],
'Age' : [23, 21, 22, 21],
'Place':['kollam','kannur','idukki','alapuzha']
}
df = pd.DataFrame(details)
x=df.head(2)
x

        Name  Age   Place
0      Ankit   23  kollam
1  Aishwarya   21  kannur

In [ ]:
#qn9

In [60]:
lists=[['Vinay','engineer',60000],
['Kushal','doctor',70000],
['Aman','engineer',50000],
['Rahul','doctor',60000],
['Ramesh','doctor',65000]]
df = pd.DataFrame(lists, columns = ['name', 'job', 'salary'])      
avg = df.groupby('job')['salary'].mean() 
print(avg)

job
doctor      65000.0
engineer    55000.0
Name: salary, dtype: float64

In [ ]:
#qn10

In [56]:
lists = [[2, 'Vishal'],
         [1, 'Kushal', 25],
         ['Aman', 24]]
dataframe = pd.DataFrame(lists, columns = ['id', 'name', 'age'])
dataframe_nullfill = dataframe.fillna(0)
print(dataframe_nullfill)

     id    name   age
0     2  Vishal   0.0
1     1  Kushal  25.0
2  Aman      24   0.0

In [ ]:
#qn11

In [70]:
d1={'eid':['aa','bb','cc'],
    'ename':['dev','jay','bell'],
    'stipend':[20000,7600,45000],}
df1=pd.DataFrame(d1)

d1={'eid':['aa','bb','cc'],
    'designation':['ceo','cco','gm']}
df2=pd.DataFrame(d1)

df=pd.merge(d1,d2,how='inner',on='eid')
df

TypeError: Can only merge Series or DataFrame objects, a <class 'dict'> was passed

In [2]:
df = pd.DataFrame({'cname':['Stark Industries','Fregata Industries','Bromley Sports', 'Marco Donateli'],
                  'profit':[1500000,-2400000,6540000,-502000]})
df["profit"] = df["profit"] > 0

print(df)

                cname  profit
0    Stark Industries    True
1  Fregata Industries   False
2      Bromley Sports    True
3      Marco Donateli   False

In [ ]:
#qn12

In [3]:
df1 = pd.DataFrame({'eid':[11,12,13,14,15,16,17],
                   'ename':['Bob','Alice','Robert','Henry','Graham','Patrick','Paul'],
                   'stipend':[10000,10000,5000,15000,5000,10000,10000]})

df2 = pd.DataFrame({'eid':[11,12,13,14,15,16,17],
                   'designation':["Employee","Employee","Intern","Senior Employee","Intern","Employee","Employee"]})

dataframe = pd.merge(df1, df2, how = 'inner', on = 'eid')

dataframe

   eid    ename  stipend      designation
0   11      Bob    10000         Employee
1   12    Alice    10000         Employee
2   13   Robert     5000           Intern
3   14    Henry    15000  Senior Employee
4   15   Graham     5000           Intern
5   16  Patrick    10000         Employee
6   17     Paul    10000         Employee